---
title     : "Fonts"
layout    : page
permalink : /Fonts/
---

Test page for fonts. All vertical bars should line up.

\begin{code}
{-
--------------------------|
abcdefghijklmnopqrstuvwxyz|
ABCDEFGHIJKLMNOPQRSTUVWXYZ|
ᵃᵇᶜᵈᵉᶠᵍʰⁱʲᵏˡᵐⁿᵒᵖ ʳˢᵗᵘᵛʷˣʸᶻ|
ᴬᴮ ᴰᴱ ᴳᴴᴵᴶᴷᴸᴹᴺᴼᴾ ᴿ ᵀᵁⱽᵂ   |
ₐ   ₑ   ᵢⱼ    ₒ  ᵣₛₜᵤ  ₓ  |
𝔸𝔹ℂ𝔻𝔼𝔽𝔾ℍ𝕀𝕁𝕂𝕃𝕄ℕ𝕆ℙℚℝ𝕊𝕋𝕌𝕍𝕎𝕏𝕐ℤ|
--------------------------|
----------|
0123456789|
⁰¹²³⁴⁵⁶⁷⁸⁹|
₀₁₂₃₄₅₆₇₈₉|
----------|
------------------------|
αβγδεζηθικλμνξοπρστυφχψω|
ΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩ|
------------------------|
----|
ℕℕℕℕ|
∀∀∃∃|
ƛƛ··|
′′″″|
‴‴⁗⁗|
††‡‡|
''""|
``~~|
≡≡≢≢|
≃≃≲≲|
≟≟≐≐|
∸∸^^|
⟨⟨⟩⟩|
⌊⌊⌋⌋|
⌈⌈⌉⌉|
→→⇒⇒|
←←⇐⇐|
——↠↠|
∈∈∋∋|
⊢⊢⊣⊣|
∷∷∷∷|
∎∎∎∎|
⦂⦂⦂⦂|
----|
-}
\end{code}

Here are some characters that are exactly two spaces wide.
\begin{code}
{-
----|
😇😇|
😈😈|
----|
-}
\end{code}

Here are some characters that are not used because they are not monospaced.

\begin{code}
{-
------------|
⟶⟶⟶⟶|
⟹⟹⟹⟹|
------------|
----------|
𝕒𝕓𝕔𝕕𝕖𝕗𝕘𝕙𝕚𝕛|
𝑎𝑏𝑐𝑑𝑒𝑓𝑔𝑖𝑗𝑘|
----------|

-}
\end{code}
